{
    "storyTitle": "Retail Horrors",
    "story": "The summer before my Sophomore year of college, I worked as a cashier at CVS. Needless to say the experience motivated me to never want to work such a job ever again, as the pay was pretty bad and the work was very boring. I spent most of my time standing at the register for eight hours, ringing customers up as they came to the counter. Many people knew the deal -- be pleasent and get through the transaction as quickly as possible. However, I came to learn that a select few people that came into the store were looking for trouble. Whether it be issues with coupons, or just genuine rage, some customers were not a treat to deal with.\nBad encounters with customers, while infrequent, always left a bad taste in my mouth. While some were unreasonable, you could tell many were having trouble and simply wanted a solution. Perhaps one of the toughest things for a retail worker to deal with is how little power they have for how often they have to interact with the customers. After working a couple weeks, I picked up on where most of the issues originated. However, as someone with no access to override coupons or enforce discounts when they weren't in the system properly, I had to rely on calling to a manager each time something simple went wrong. Nothing is more frustrating than bureaucracy, and it was a constant struggle in retail.\nAs expected, there were some frequent offenders that I had to deal with on a weekly or daily basis. These people had 0 regard or respect for the people in the store. They abused the coupon system by having multiple discounts, argued for every penny, and were tried to prey on the easiest target to get away with things. The store did very little to protect the workers from these people, and dealing with them was always a pain. Their transactions would take over 15 minutes each time, with the people simply coming in for a couple of items getting frustated by the line. If only the people trying to get discounts at CVS, a store with ridiculously high prices on many items, would realize they could save money with less planning by going across the street to Walmart then everyone would be better off.\nDespite my ranting about retail, which I could go on and on with, my experiences this past summer as a Software Developer at Colgate-Palmolive Company proved that where you work doesn't guarantee things will change. Still at this job, I was at constant battle with bureaucracy. However, I found that the customers, the users of my product, were often more inclined to be reasonable. There is a level of mutual respect since we both shared a common goal. I was also doing something I enjoyed, which cannot be taken for granted. Perhaps if I had worked a retail job in high school, other than helping my dad out at his business ocassionally, then I would have had the foresight to go for a programming job my Freshman year.  "
}